# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Import the dataset from the file given in the repo US_Baby_Names_right.csv

In [2]:
baby_names = pd.read_csv('./US_Baby_Names_right.csv')

### Step 3. Assign it to a variable called baby_names.

In [3]:
baby_names

         Unnamed: 0       Id     Name  Year Gender State  Count
0             11349    11350     Emma  2004      F    AK     62
1             11350    11351  Madison  2004      F    AK     48
2             11351    11352   Hannah  2004      F    AK     46
3             11352    11353    Grace  2004      F    AK     44
4             11353    11354    Emily  2004      F    AK     41
...             ...      ...      ...   ...    ...   ...    ...
1016390     5647421  5647422     Seth  2014      M    WY      5
1016391     5647422  5647423  Spencer  2014      M    WY      5
1016392     5647423  5647424     Tyce  2014      M    WY      5
1016393     5647424  5647425   Victor  2014      M    WY      5
1016394     5647425  5647426   Waylon  2014      M    WY      5

[1016395 rows x 7 columns]

### Step 4. See the first 10 entries

In [4]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [5]:
baby_names.loc[:, "Name":]

            Name  Year Gender State  Count
0           Emma  2004      F    AK     62
1        Madison  2004      F    AK     48
2         Hannah  2004      F    AK     46
3          Grace  2004      F    AK     44
4          Emily  2004      F    AK     41
...          ...   ...    ...   ...    ...
1016390     Seth  2014      M    WY      5
1016391  Spencer  2014      M    WY      5
1016392     Tyce  2014      M    WY      5
1016393   Victor  2014      M    WY      5
1016394   Waylon  2014      M    WY      5

[1016395 rows x 5 columns]

### Step 6. Is there more male or female names in the dataset?

In [6]:
baby_names['Gender'].value_counts()

Gender
F    558846
M    457549
Name: count, dtype: int64

### Step 7. Group the dataset by name and assign to names

In [7]:
names = baby_names.groupby('Name')
print(names)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001BAFF00FBE0>

### Step 8. How many different names exist in the dataset?

In [12]:
baby_names['Name'].shape[0]

1016395

### Step 9. What is the name with most occurrences?

In [13]:
names['Name'].value_counts().idxmax()

'Riley'

### Step 10. How many different names have the least occurrences?

In [14]:
names["Name"].value_counts().idxmin()

'Aadarsh'

### Step 11. What is the median name occurrence?

In [15]:
baby_names.loc[baby_names["Name"].value_counts().median()]

Unnamed: 0     11357
Id             11358
Name          Alyssa
Year            2004
Gender             F
State             AK
Count             29
Name: 8, dtype: object

### Step 12. What is the standard deviation of names?

In [16]:
baby_names.loc[baby_names["Name"].value_counts().std()]

KeyError: np.float64(122.0299635081389)

### Step 13. Get a summary with the mean, min, max, std and quartiles.